package com.ks.bean;

import java.util.List;

public class RankingBean {

    /**
     * status : 200
     * data : [{"id":"4058227148","is_main":"0","main_id":"0","gender":"2","category":"现代言情","title":"新婚夜残废老公站起来了","intro":"爹不疼后娘不爱，她被刮花了脸，从乡下接来，冲喜嫁给秦家的病秧子，还是个六夫人。\n听说，那病秧子已经虐死了五任妻子。\n新婚后，众人等着看她笑话\u2026\u2026\n翌日，众人翘首以盼的乡下丑丫头出现了，穿的全球限定时装，开的绝版跑车，身边还站了一个神颜小白脸。\n吐血，那病秧子不管吗？！","author":"西瓜满满","state":"连载","words":"201811","score":"4.5","chap_num":"3513","last_cid":"0","last_chap":"","last_at":"","last_in":"2021-03-22 10:38:55","updated_at":"","cover":"images/default_image.webp","read_user_count":"0","click_count":"4","read_count":"4","v":"1623160029"},{"id":"4058238669","is_main":"0","main_id":"0","gender":"2","category":"玄幻言情","title":"公主她一心要谋反","intro":"那时，他仅仅只是一个背影，就成为了她希望的光芒。 一句\u201c我们成婚\u201d成为二人一生的牵绊。 \u201c除了改变质子这个身份，你好像从未把任何事放在心上。\u201d叶兮坐在房顶，无意间感慨道。 闻言，花辞扭头，彼时，叶兮的眼里是天上的明月，而花辞的眼里，是比月还明亮的叶兮，他没告诉她：我从不把任何事放心上，除了你！","author":"猫不吃鱼","state":"连载","words":"35056","score":"3.8","chap_num":"2625","last_cid":"0","last_chap":"","last_at":"","updated_at":"","cover":"images/default_image.webp","read_user_count":"0","v":"1615761761"},{"id":"4058323537","is_main":"0","main_id":"0","gender":"2","category":"现代言情","title":"顶流男神：头号黑粉是老婆","intro":"徐谨言，出道即巅峰，唱歌，跳舞，演戏，颜值和实力并存，乃顶流本流！ 亿万少女梦想得到徐谨言，却不知他有一个藏在心尖的小青梅。 秦深，甜美化妆师，一双巧手不仅能化腐朽为神奇，还能敲打键盘让人分分钟怀疑人生。 徐谨言归国追妻，没想到那个天天在他微博底下怼天怼地的小作精就是他老婆！ 徐谨言滑着手机上动辄几百字对他的批斗文，再看看坐在那唯唯诺诺的小女人，轻扬嘴角，后来，秦深面对徐谨言布的\u201c作业\u201d咬牙切齿\u2014\u2014每个礼拜都要在他的微博底下发一篇五百字的小作文，言语间必须是对他的赞美，太太太难了！ 顶流头号黑粉画风突变！众人追问：博主是不是被挟持了？ 徐谨言@最大的黑粉头子发声：不好意思，我老婆给大家添麻烦了。 微博彻底瘫痪了！ 破镜重圆，顶流男神追妻火葬场，不甜不要钱~","author":"陈年老絮","state":"连载","words":"95811","score":"1.2","chap_num":"2530","last_cid":"0","last_chap":"","last_at":"","updated_at":"","cover":"images/default_image.webp","read_user_count":"0","v":"1612922770"},{"id":"4058341048","is_main":"0","main_id":"0","gender":"2","category":"现代言情","title":"替嫁成婚","intro":"她不得不代替自己的妹妹嫁入豪门宫家。\n他，真正的继承人，叱咤风云的商业帝王，冷酷无情的职场暴君，女人们的做梦都想嫁的人。\n她替他治好了隐疾，眼看着事有所成，婚约也已经解除，就剩下虐渣报仇的时候，他却被人夺走一切身无分文。\n她看着找上门的一大一小，认了命：\u201c行，我养。\u201d\n他藏好亿万资产，一脸认真：\u201c爷爷留下遗产，我们复婚就可以取。\u201d\n\u201c好，复婚。\u201d\n\u201c爷爷还说了，二胎也有奖励。\u201d\n\u201c不行，你拿孩子当商品。\u201d\n某宝抱着储蓄罐钻出来，挥金如土：\u201c妈妈，给我来一个，哦不，俩妹妹。\u201d\n时间越久，叶梦之越觉得自己掉进了一个圈套，她好像被骗婚了。","author":"啵啵","state":"连载","words":"746402","score":"4.6","chap_num":"2833","last_cid":"0","last_chap":"","last_at":"","updated_at":"","cover":"images/default_image.webp","read_user_count":"0","v":"1622626543"},{"id":"4058350260","is_main":"0","main_id":"0","gender":"2","category":"科幻空间","title":"穿到七零搞事业","intro":"一觉醒来发现自己穿越的林青青，看着周围家徒四壁的家，以及底下嗷嗷待哺的老小，一脸的沧桑。 秉承着来都来了的原则，林青青拿出自己农业专家的专业姿势，势必要把这个吃了上顿没下顿，极度贫困的家，给一步一步带向小康。 只是还没等她的大志宏图，开始施行第一步，周围那些气死人不偿命的，极品亲戚就开始过来闹事。 这边林青青刚赶走极品亲戚，带着一家老小过上吃饱穿暖的富足小日子，那边隔壁邻居家的小哥，你怎么又巴巴的跑过来了\u2026\u2026","author":"火火","state":"连载","words":"39568","score":"8.8","chap_num":"8744","last_cid":"0","last_chap":"","last_at":"","updated_at":"","cover":"images/default_image.webp","read_user_count":"0","v":"1614120098"},{"id":"4058352315","is_main":"0","main_id":"0","gender":"2","category":"科幻空间","title":"快穿之太子再虐你一遍","intro":"天界的太子殿下生性风流，沾花惹草，天帝一怒之下，将他贬下凡尘，轮回九世，受断情绝爱之苦。左司命表示：皇太子的命簿\u2026难写！可怜那小司灵被当作挡箭牌推了出去，夏颜叹息：\u201c虐太子我不敢\u2026\u2026\u201d她只能对自己下狠手，挡箭，跳崖，挖心，换眼\u2026\u2026夏颜的原则就是虐他一千，自毁八百！回到天宫之后\u2026\u2026夏颜可怜巴巴的说：\u201c太子殿下看我这么惨的份上，您饶了我吧！\u201d 太子：\u201c呵呵，你抛弃了孤几次？\u201d众人：太子不渣，他爱一个人能爱到骨子里。","author":"谜一样的我","state":"连载","words":"770000","score":"5.1","chap_num":"9078","last_cid":"0","last_chap":"","last_at":"","updated_at":"","cover":"images/default_image.webp","read_user_count":"0","v":"1618181689"},{"id":"4058355162","is_main":"0","main_id":"0","gender":"2","category":"现代言情","title":"最强萌宝：团宠妈咪是大佬","intro":"360线女演员顾北歌回到国内的第一份工作，竟是扮演陆家小太子爷的妈咪？只是这演着演着，怎么要变成真的了？一大一小千层套路把她骗回家。陆靖臣：\u201c你救了我，我要以身相许报答你。\u201d陆奕白：\u201c你救了我爹地，我要以爹相许！\u201d顾北歌：\u201c\u2026\u2026\u201d无痛当妈了解一下？","author":"殷小言","state":"连载","words":"300000","score":"3.2","chap_num":"2259","last_cid":"0","last_chap":"","last_at":"","updated_at":"","cover":"images/default_image.webp","read_user_count":"0","v":"1619167807"},{"id":"4058388739","is_main":"0","main_id":"0","gender":"2","category":"玄幻言情","title":"穿书之爽文主角的自我修养","intro":"　　某男女频俩大网文网站巨头一同穿成彼此玄幻爽文的男女主，从此开启了平（xiang）平（ai）淡（xiang）淡（sha）的沙雕日常。　　朱起：\u201c快，撒了他！你丫还是不是我大孤儿院男主！\u201d　　青晋：\u201c撒个鸡鹅，那是劳资辛辛苦苦帮你钓的鱼，你给我清醒一点！\u201d　　苏爽脑残文，升级流爽文男主x降智玛丽苏女主（误）","author":"邪歌","state":"连载","words":"26000","score":"1.8","chap_num":"2860","last_cid":"0","last_chap":"","last_at":"","updated_at":"","cover":"images/default_image.webp","read_user_count":"0","v":"1628497440"},{"id":"4058400045","is_main":"0","main_id":"0","gender":"2","category":"科幻空间","title":"嫁给傲娇王爷，升级全靠作","intro":"南星来到九藏大陆，睁眼竟然是傲娇狱王爷的卧房？等等，这是什么情况？身为低等丫鬟的她，为什么会在王爷的卧房？什么？傲娇王爷竟要在今晚和她成亲？！这不是作死吗！系统激活！只要够作往死里作就能获得系统奖励！？开局在狱王爷面前作死，踏出升级第一步\u2026\u2026\u2026","author":"翻滚的牛宝宝","state":"连载","words":"160000","score":"4.7","chap_num":"5219","last_cid":"0","last_chap":"","last_at":"","updated_at":"","cover":"images/default_image.webp","read_user_count":"0","v":"1632315495"},{"id":"4058461885","is_main":"0","main_id":"0","gender":"2","category":"现代言情","title":"休想抢我前妻","intro":"　　【简介】明明他先出轨，她倒反成了过街老鼠，父母和她断绝关系，疼爱她的婆婆逼着她和他宝贝儿子离婚。 而他此时此刻竟然还怒不可遏的掐着她脖子：\u201c贱人，你竟然敢做对不起我的事，说，那个男人是谁，我杀了他！\u201d 她忍无可忍：\u201c秦展尧，这不是你一直想要的吗，现在装这副受委屈的样子给谁看，我告诉你，我再也忍受不了你了，我要和你离婚！\u201d他愕住，离婚后，她狼狈决然，仿佛从不认识他。两年后，她高傲美丽的出现在各大时尚媒体上，听说即将再嫁豪门\u2026\u2026她好不容易决定忘掉过往重新站起来，谁知这个几面之缘不到的亿万总裁卓雅烈竟然突然冒出来说让她负责。","author":"葉雪","state":"完本","words":"1140000","score":"7.5","chap_num":"3451","last_cid":"0","last_chap":"","last_at":"","updated_at":"","cover":"images/default_image.webp","read_user_count":"0","v":"1612484695"},{"id":"4058470195","is_main":"0","main_id":"0","gender":"2","category":"现代言情","title":"分手后我和首富闪婚了","intro":"南城首富顾司寒娶了个作天作地的小媳妇，在所有人都忙着替顾司寒可惜的时候，顾司寒在忙着无下限宠妻。 某日，助理慌张道：\u201c三爷，小夫人和赵小姐打起来了，还把人腿打断了。\u201d 顾司寒神情自若：\u201c没事，腿断了可以接回去！\u201d \u201c三爷，小夫人的小绵羊刮到别人的车了，嚷着赔300万不说，还对夫人动手了！\u201d 顾司寒抿了一口手里的牛奶：\u201c车砸了，给300万，把人打残，再给200万！\u201d 南城所有人都知道，顾司寒将傅九宠上天，本以为傅九会紧紧抱着这条金大腿！ 直到！ 她要离婚，他暴怒：\u201c傅九，天底下的女人多了去，你以为老子非你不可，离婚，谁反悔谁是狗。\u201d 当傅九拉着顾司寒出现在民政局门口的时候，她身后传来一声：\u201c汪~\u201d 哎呀妈，真香！","author":"许七安","state":"连载","words":"2320000","score":"8.8","chap_num":"5528","last_cid":"0","last_chap":"","last_at":"","updated_at":"","cover":"images/default_image.webp","read_user_count":"0","v":"1613550824"},{"id":"4058477486","is_main":"0","main_id":"0","gender":"2","category":"现代言情","title":"一胎两宝总裁爹地还想要","intro":"盛安然被同父异母的姐姐陷害，和陌生男人过夜，还怀了孕！\n她去医院，却告知有人下命，不准她流掉。\n十月怀胎，盛安然生孩子九死一生，最后却眼睁睁看着孩子被抱走。\n数年后她回国，手里牵着漂亮的小男孩，没想到却遇到了正版。\n男人拽着她的手臂，怒道：\u201c你竟然敢偷走我的孩子？\u201d\n小男孩一把将男人推开，冷冷道：\u201c不准你碰我妈咪，她是我的！\u201d","author":"豆豆","state":"连载","words":"1112118","score":"7.1","chap_num":"1605","last_cid":"0","last_chap":"","last_at":"","updated_at":"","cover":"images/default_image.webp","read_user_count":"0","v":"1633059067"},{"id":"4058491573","is_main":"0","main_id":"0","gender":"2","category":"科幻空间","title":"我穿成了男主的反派师姐","intro":"文绮梦一朝穿书，竟进了一篇早已经忘记剧情的种马文，成了被魔尊男主挫骨扬灰的反派师姐。 文绮梦只能一路战战兢兢，疯狂找男主抱大腿，想方设法在剧情的夹缝中求生存，避开自己的死亡flag，努力活下去。 然后\u2026\u2026原著剧情就开始放飞自我了。 文绮梦：\u201c一开始没说还有生孩子这回事啊？\u201d 莫秋生：\u201c我是一个精通人性的师弟，一句话能让师姐给我生十八个孩子。\u201d 文绮梦：\u201c？？？\u201d","author":"瑶台月","state":"连载","words":"280000","score":"5.9","chap_num":"6374","last_cid":"0","last_chap":"","last_at":"","updated_at":"","cover":"images/default_image.webp","read_user_count":"0","v":"1617618929"},{"id":"4058515241","is_main":"0","main_id":"0","gender":"2","category":"科幻空间","title":"穿书：王妃混成团宠了吗","intro":"　 林迎梦穿成了书中女配，这本书她还看过。 　　原身本是护国将军唯一的女儿，上面有四个哥哥，皆是人中翘楚，后又因婚约嫁给身份尊贵的楚临王。 　　本该是受人宠爱的掌上明珠，却因为原主的嚣张跋扈，让楚临王和哥哥们对她厌恶到了极致。 　　知道剧情的林迎梦满腔热血，势必要改写结局。 　　某日四个哥哥发现，自家的小祖宗突然转了性。 　　先前对他们呼来喝去，如今一口一个哥哥叫的甜着呢。 　　遭人陷害后也没有大吵大闹，而是沉着冷静的设计反杀。 　　就连那个说什么都不娶她的楚临王，也开始真香了\u2026\u2026 　　某王爷：\u201c嫁给本王，以后不管你闯了什么祸，本王都帮你解决。\u201d 　　林迎梦：\u201c昨天我不小心把贵妃的头发烧了，现在你皇兄正满世界找我呢！\u201d 　　\u201c\u2026\u2026好，我去解决。\u201d某王爷无奈入宫。 　　众人错愕，说好的不娶呢？","author":"半斤可爱","state":"连载","words":"290000","score":"7.3","chap_num":"9868","last_cid":"0","last_chap":"","last_at":"","updated_at":"","cover":"images/default_image.webp","read_user_count":"0","v":"1611568396"},{"id":"4058528890","is_main":"0","main_id":"0","gender":"2","category":"现代言情","title":"私婚密爱","intro":"\u201c婚后我们分房睡，各玩各的。\u201d\n凌呈羡爽快答应。\u201c好。\u201d\n可还没等他发挥风流本性，传言就一个个砸了过来。\u201c少奶奶在会所聚众玩乐\u2026\u2026\u201d\u201c少奶奶夜会前男友被曝光\u2026\u2026\u201d\n男人咬牙切齿将她按在墙上，\u201c各玩各的意思是，你玩我，我玩你！\u201d","author":"顾小易","state":"连载","words":"3241891","score":"6.1","chap_num":"6326","last_cid":"0","last_chap":"","last_at":"","updated_at":"","cover":"images/default_image.webp","read_user_count":"0","v":"1637554278"},{"id":"4058549432","is_main":"0","main_id":"0","gender":"2","category":"现代言情","title":"婚内燃情：薄总的掌心娇","intro":"暗恋多年，终于姻缘相定。 然而未婚夫却把她当成礼物送上了别人的床。 继母凶毒，继妹白莲花。 渣男作恶。 她成为了孤苦伶仃的可怜人。 就在全世界都不要她的时候。 初夜相遇的男人站了出来。 \u201c跟我在一起，你就是渣男的婶婶。\u201d \u201c所有人都要为你让路！\u201d 本想利用一把，没想到却进了男人早已编制好的牢笼。","author":"爱笑的大饼","state":"连载","words":"220000","score":"6.2","chap_num":"952","last_cid":"0","last_chap":"","last_at":"","updated_at":"","cover":"images/default_image.webp","read_user_count":"0","v":"1635114118"},{"id":"4058570801","is_main":"0","main_id":"0","gender":"2","category":"科幻空间","title":"重生八零：煤老板的科技小甜妹","intro":"　 富家娇娇女穿成了80年代西北山沟沟里的傻闺女，看着一家子老实憨厚被人欺负都没脾气的家人，陈甜甜撸起袖子，开启了护犊子模式。 　　靠着\u2018星际空间站\u2019系统，她带领家人吃饱喝足、脱贫致富。 　　被村里人嘲笑是个傻子，只配嫁给村里的二流子？ 　　不好意思，富通煤矿继承人是她对象。她对象不光有钱，还八块腹肌、大长腿，颜值赛过刘德华。 　　被白富美嘲笑没文化、难等大雅之堂？ 　　哎呀，西山最大的陈家砖厂、全国闻名的飞天地砖以及世界顶级的甜牌计算机的老板，都叫陈甜甜呢。","author":"一问三不知","state":"连载","words":"35167","score":"5.6","chap_num":"5758","last_cid":"0","last_chap":"","last_at":"","updated_at":"","cover":"images/default_image.webp","read_user_count":"0","v":"1634580573"},{"id":"4058572342","is_main":"0","main_id":"0","gender":"2","category":"玄幻言情","title":"重生成摄政王的掌心宠","intro":"前世，沐蛮蛮错信渣男，害的至亲惨死。\n父亲受尽剔骨之刑，大哥被野狗分食，二哥死在石碾子之下，自己则被挂在城楼上。\n重活一世，抱紧寒王爷大腿。\n手撕了太后封赏的宠妾，脚踹夫君白月光；\n世人都骂她心狠手辣，怜惜寒王爷这朵鲜花插在她的牛粪上。\n沐蛮蛮霸气呵呵：\u201c我爹是国师，我娘是大宗师，哥哥是大将军，嫂子是公主，姐姐是邻国皇后，哪一点配不上他？！\u201d\n寒王宠溺的搂住自家夫人的小蛮腰：\u201c配不配，用得着你们这群渣渣说？\u201d","author":"司言","state":"连载","words":"101323","score":"1.8","chap_num":"253","last_cid":"0","last_chap":"","last_at":"","updated_at":"","cover":"images/default_image.webp","read_user_count":"0","v":"1632442177"},{"id":"4058607634","is_main":"0","main_id":"0","gender":"2","category":"现代言情","title":"沈少，夫人她又带崽满世界虐渣了","intro":"五年前颜真为了家族未来和腹中胎儿，选择隐忍暂时远走海外。 面对庶出的私生女妹妹颜洁的各种挑衅，夺权，以及未婚夫张子轩的背叛，淡定冷静，视若无睹。 五年后，她载誉而归，成为享誉世界的医科圣手，诊疗号更是一号难求，全世界的富豪权贵都对她礼让三分，趋之若骛。 王者归来，暗战爆发，商战，心理战，阴阳五行精粹的抢夺轮番上演。 为了给女儿麦和根治顽疾，既是布局的人，又深陷局中的颜真和沈琛两人，强强联手，掌握主动权，将大局之中的数十个顶级家族，耍的团团转。 一双龙凤胎儿女更是萌翻全场，成为沈琛追妻的最强助攻。 麦奇揉着他那头标志性蓬松卷发，扶额轻叹，\u2018哎，这届家长可真难带！\u2019 麦和抱着布娃娃，眨巴着那双龙眸子，陷入深思，\u201c恩，当如何让爹地俘获妈咪的芳心，九万朵玫瑰花够不够？\u201d 高冷矜贵如同王子的沈琛，左手搓衣板，右手榴莲壳，语气温柔至极。 \u201c老婆，你看哪个合适？\u201d 颜真声线清冷，\u2018今儿个心情好，免了！\u2019 沈琛长出一口气，我夫人这是虐渣虐爽了！","author":"五福临门","state":"连载","words":"32574","score":"0.3","chap_num":"6549","last_cid":"0","last_chap":"","last_at":"","updated_at":"","cover":"images/default_image.webp","read_user_count":"0","v":"1636799538"},{"id":"4058615215","is_main":"0","main_id":"0","gender":"2","category":"现代言情","title":"重生成病娇大佬的掌心宠","intro":"前世，她被渣男和好闺蜜联手害死，还害死了那个最爱她的老公。 重来一世，她不仅要手撕贱人，打脸虐渣，还要追夫火葬场。 第一步就是主动嫁给顾祈楠。 \u201c顾先生，如果你愿意娶我，就带我回家！\u201d \u201c好！\u201d 男人一把将她扛起，带回家不是成婚，居然是锁起来？ 所以，前世那个深情隐忍的男人，现在为什么变成了一个妥妥的病娇？？？","author":"菜薇薇","state":"连载","words":"280000","score":"3.6","chap_num":"9748","last_cid":"0","last_chap":"","last_at":"","updated_at":"","cover":"images/default_image.webp","read_user_count":"0","v":"1611269552"}]
     * message : 成功
     */

    public String status;
    public String message;
    public List<DataBean> data;
    
    public static class DataBean {
        /**
         "id": "4058227148", # 书id
         "is_main": "0",  # 是否别名书：0不是，1是
         "main_id": "0", # 主书id，点击章节列表时，需要使用主书id
         "gender": "2",  # 男女频：1男频，2女频
         "category": "现代言情",  # 分类
         "title": "新婚夜残废老公站起来了",  # 标题
         "intro": "爹不疼后娘不爱，她被刮花了脸，从乡下接来，冲喜嫁给秦家的病秧子，还是个六夫人。\n听说，那病秧子已经虐死了五任妻子。\n新婚后，众人等着看她笑话……\n翌日，众人翘首以盼的乡下丑丫头出现了，穿的全球限定时装，开的绝版跑车，身边还站了一个神颜小白脸。\n吐血，那病秧子不管吗？！",
         "author": "西瓜满满",  # 作者
         "state": "连载",  # 状态
         "words": "201811",  # 字数
         "score": "4.5",  # 评分
         "chap_num": "3513",  # 章节数
         "last_cid": "0",  # 最后章节id
         "last_chap": "",  # 最后章节名
         "last_at": "",  # 最后章节更新时间
         "last_in": "2021-03-22 10:38:55",  # 最后章节入库时间
         "updated_at": "",  # 最后书籍更新时间
         "cover": "images/default_image.webp",  # 封面
         "read_user_count": "0",  # 阅读人数
         "click_count": "4",   # 点击数
         "read_count": "4",   # 阅读数
         "v": "1623160029"  # 缓存版本号
         */

        public String id;
        public String is_main;
        public String main_id;
        public String gender;
        public String category;
        public String title;
        public String intro;
        public String author;
        public String state;
        public String words;
        public String score;
        public String chap_num;
        public String last_cid;
        public String last_chap;
        public String last_at;
        public String last_in;
        public String updated_at;
        public String cover;
        public String read_user_count;
        public String click_count;
        public String read_count;
        public String v;

    }
}
